export const COUNTY_NAME_TO_CODE = {
    "基隆市": "KEE",
    "臺北市": "TPE",
    "新北市": "NTP",
    "桃園市": "TAO",
    "新竹市": "HSC",
    "新竹縣": "HSH",
    "苗栗縣": "MIA",
    "臺中市": "TXG",
    "彰化縣": "CHA",
    "南投縣": "NAN",
    "雲林縣": "YUN",
    "嘉義市": "CYI",
    "嘉義縣": "CYQ",
    "臺南市": "TNN",
    "高雄市": "KHH",
    "屏東縣": "PIF",
    "宜蘭縣": "ILA",
    "花蓮縣": "HUA",
    "臺東縣": "TTT",
    "澎湖縣": "PEN",
    "金門縣": "KIN",
    "連江縣": "LIE"
};

export const LOCATION_DATA = {
    "臺北市": {
        "中正區": "TPE-100", "大同區": "TPE-103", "中山區": "TPE-104", "松山區": "TPE-105", "大安區": "TPE-106", "萬華區": "TPE-108", "信義區": "TPE-110", "士林區": "TPE-111", "北投區": "TPE-112", "內湖區": "TPE-114", "南港區": "TPE-115", "文山區": "TPE-116"
    },
    "基隆市": {
        "仁愛區": "KEE-200", "信義區": "KEE-201", "中正區": "KEE-202", "中山區": "KEE-203", "安樂區": "KEE-204", "暖暖區": "KEE-205", "七堵區": "KEE-206"
    },
    "新北市": {
        "萬里區": "NTP-207", "金山區": "NTP-208", "板橋區": "NTP-220", "汐止區": "NTP-221", "深坑區": "NTP-222", "石碇區": "NTP-223", "瑞芳區": "NTP-224", "平溪區": "NTP-226", "雙溪區": "NTP-227", "貢寮區": "NTP-228", "新店區": "NTP-231", "坪林區": "NTP-232", "烏來區": "NTP-233", "永和區": "NTP-234", "中和區": "NTP-235", "土城區": "NTP-236", "三峽區": "NTP-237", "樹林區": "NTP-238", "鶯歌區": "NTP-239", "三重區": "NTP-241", "新莊區": "NTP-242", "泰山區": "NTP-243", "林口區": "NTP-244", "蘆洲區": "NTP-247", "五股區": "NTP-248", "八里區": "NTP-249", "淡水區": "NTP-251", "三芝區": "NTP-252", "石門區": "NTP-253"
    },
    "桃園市": {
        "中壢區": "TAO-320", "平鎮區": "TAO-324", "龍潭區": "TAO-325", "楊梅區": "TAO-326", "新屋區": "TAO-327", "觀音區": "TAO-328", "桃園區": "TAO-330", "龜山區": "TAO-333", "八德區": "TAO-334", "大溪區": "TAO-335", "復興區": "TAO-336", "大園區": "TAO-337", "蘆竹區": "TAO-338"
    },
    "新竹市": {
        "東區": "HSC-300", "北區": "HSC-300", "香山區": "HSC-300"
    },
    "新竹縣": {
        "竹北市": "HSH-302", "湖口鄉": "HSH-303", "新豐鄉": "HSH-304", "新埔鎮": "HSH-305", "關西鎮": "HSH-306", "芎林鄉": "HSH-307", "寶山鄉": "HSH-308", "竹東鎮": "HSH-310", "五峰鄉": "HSH-311", "橫山鄉": "HSH-312", "尖石鄉": "HSH-313", "北埔鄉": "HSH-314", "峨眉鄉": "HSH-315"
    },
    "苗栗縣": {
        "竹南鎮": "MIA-350", "頭份市": "MIA-351", "三灣鄉": "MIA-352", "南庄鄉": "MIA-353", "獅潭鄉": "MIA-354", "後龍鎮": "MIA-356", "通霄鎮": "MIA-357", "苑裡鎮": "MIA-358", "苗栗市": "MIA-360", "造橋鄉": "MIA-361", "頭屋鄉": "MIA-362", "公館鄉": "MIA-363", "大湖鄉": "MIA-364", "泰安鄉": "MIA-365", "銅鑼鄉": "MIA-366", "三義鄉": "MIA-367", "西湖鄉": "MIA-368", "卓蘭鎮": "MIA-369"
    },
    "臺中市": {
        "中區": "TXG-400", "東區": "TXG-401", "南區": "TXG-402", "西區": "TXG-403", "北區": "TXG-404", "北屯區": "TXG-406", "西屯區": "TXG-407", "南屯區": "TXG-408", "豐原區": "TXG-420", "后里區": "TXG-421", "石岡區": "TXG-422", "東勢區": "TXG-423", "和平區": "TXG-424", "新社區": "TXG-426", "潭子區": "TXG-427", "大雅區": "TXG-428", "神岡區": "TXG-429", "大肚區": "TXG-432", "沙鹿區": "TXG-433", "龍井區": "TXG-434", "梧棲區": "TXG-435", "清水區": "TXG-436", "大甲區": "TXG-437", "外埔區": "TXG-438", "大安區": "TXG-439", "太平區": "TXG-411", "大里區": "TXG-412", "霧峰區": "TXG-413", "烏日區": "TXG-414"
    },
    "彰化縣": {
        "彰化市": "CHA-500", "芬園鄉": "CHA-502", "花壇鄉": "CHA-503", "秀水鄉": "CHA-504", "鹿港鎮": "CHA-505", "福興鄉": "CHA-506", "線西鄉": "CHA-507", "伸港鄉": "CHA-508", "員林市": "CHA-510", "社頭鄉": "CHA-511", "永靖鄉": "CHA-512", "埔心鄉": "CHA-513", "溪湖鎮": "CHA-514", "大村鄉": "CHA-515", "埔鹽鄉": "CHA-516", "田中鎮": "CHA-520", "北斗鎮": "CHA-521", "田尾鄉": "CHA-522", "埤頭鄉": "CHA-523", "芳苑鄉": "CHA-524", "二林鎮": "CHA-525", "竹塘鄉": "CHA-526", "大城鄉": "CHA-527", "溪州鄉": "CHA-528"
    },
    "南投縣": {
        "南投市": "NAN-540", "中寮鄉": "NAN-541", "草屯鎮": "NAN-542", "國姓鄉": "NAN-544", "埔里鎮": "NAN-545", "仁愛鄉": "NAN-546", "名間鄉": "NAN-551", "集集鎮": "NAN-552", "水里鄉": "NAN-553", "魚池鄉": "NAN-555", "信義鄉": "NAN-556", "竹山鎮": "NAN-557", "鹿谷鄉": "NAN-558"
    },
    "雲林縣": {
        "斗南鎮": "YUN-630", "大埤鄉": "YUN-631", "虎尾鎮": "YUN-632", "土庫鎮": "YUN-633", "褒忠鄉": "YUN-634", "東勢鄉": "YUN-635", "臺西鄉": "YUN-636", "崙背鄉": "YUN-637", "麥寮鄉": "YUN-638", "斗六市": "YUN-640", "古坑鄉": "YUN-646", "莿桐鄉": "YUN-647", "林內鄉": "YUN-648", "西螺鎮": "YUN-648", "二崙鄉": "YUN-649", "北港鎮": "YUN-651", "水林鄉": "YUN-652", "口湖鄉": "YUN-653", "四湖鄉": "YUN-654", "元長鄉": "YUN-655"
    },
    "嘉義市": {
        "西區": "CYI-600", "東區": "CYI-600"
    },
    "嘉義縣": {
        "番路鄉": "CYQ-602", "梅山鄉": "CYQ-603", "竹崎鄉": "CYQ-604", "阿里山鄉": "CYQ-605", "中埔鄉": "CYQ-606", "大埔鄉": "CYQ-607", "水上鄉": "CYQ-608", "鹿草鄉": "CYQ-611", "太保市": "CYQ-612", "朴子市": "CYQ-613", "東石鄉": "CYQ-614", "六腳鄉": "CYQ-615", "新港鄉": "CYQ-616", "民雄鄉": "CYQ-621", "大林鎮": "CYQ-622", "溪口鄉": "CYQ-623", "義竹鄉": "CYQ-624", "布袋鎮": "CYQ-625"
    },
    "臺南市": {
        "中西區": "TNN-700", "東區": "TNN-701", "南區": "TNN-702", "北區": "TNN-704", "安平區": "TNN-708", "安南區": "TNN-709", "永康區": "TNN-710", "歸仁區": "TNN-711", "新化區": "TNN-712", "左鎮區": "TNN-713", "玉井區": "TNN-714", "楠西區": "TNN-715", "南化區": "TNN-716", "仁德區": "TNN-717", "關廟區": "TNN-718", "龍崎區": "TNN-719", "官田區": "TNN-720", "麻豆區": "TNN-721", "佳里區": "TNN-722", "西港區": "TNN-723", "七股區": "TNN-724", "將軍區": "TNN-725", "學甲區": "TNN-726", "北門區": "TNN-727", "新營區": "TNN-730", "後壁區": "TNN-731", "白河區": "TNN-732", "東山區": "TNN-733", "六甲區": "TNN-734", "下營區": "TNN-735", "柳營區": "TNN-736", "鹽水區": "TNN-737", "善化區": "TNN-741", "大內區": "TNN-742", "山上區": "TNN-743", "新市區": "TNN-744", "安定區": "TNN-745"
    },
    "高雄市": {
        "新興區": "KHH-800", "前金區": "KHH-801", "苓雅區": "KHH-802", "前鎮區": "KHH-806", "旗津區": "KHH-805", "小港區": "KHH-812", "鼓山區": "KHH-804", "鹽埕區": "KHH-803", "三民區": "KHH-807", "楠梓區": "KHH-811", "左營區": "KHH-813", "梓官區": "KHH-814", "彌陀區": "KHH-827", "永安區": "KHH-828", "燕巢區": "KHH-824", "橋頭區": "KHH-825", "岡山區": "KHH-820", "路竹區": "KHH-821", "阿蓮區": "KHH-822", "湖內區": "KHH-829", "茄萣區": "KHH-826", "田寮區": "KHH-823", "旗山區": "KHH-842", "美濃區": "KHH-843", "六龜區": "KHH-844", "甲仙區": "KHH-847", "杉林區": "KHH-846", "內門區": "KHH-845", "茂林區": "KHH-851", "桃源區": "KHH-848", "那瑪夏區": "KHH-849", "大樹區": "KHH-840", "仁武區": "KHH-815", "鳥松區": "KHH-833", "大社區": "KHH-815", "鳳山區": "KHH-830", "大寮區": "KHH-831", "林園區": "KHH-832"
    },
    "屏東縣": {
        "屏東市": "PIF-900", "三地門鄉": "PIF-901", "霧臺鄉": "PIF-902", "瑪家鄉": "PIF-903", "九如鄉": "PIF-904", "里港鄉": "PIF-905", "高樹鄉": "PIF-906", "鹽埔鄉": "PIF-907", "長治鄉": "PIF-908", "麟洛鄉": "PIF-909", "竹田鄉": "PIF-911", "內埔鄉": "PIF-912", "萬丹鄉": "PIF-913", "潮州鎮": "PIF-920", "泰武鄉": "PIF-921", "來義鄉": "PIF-922", "萬巒鄉": "PIF-923", "崁頂鄉": "PIF-924", "新埤鄉": "PIF-925", "南州鄉": "PIF-926", "林邊鄉": "PIF-927", "東港鎮": "PIF-928", "琉球鄉": "PIF-929", "佳冬鄉": "PIF-931", "新園鄉": "PIF-932", "枋寮鄉": "PIF-940", "枋山鄉": "PIF-941", "春日鄉": "PIF-942", "獅子鄉": "PIF-943", "車城鄉": "PIF-944", "牡丹鄉": "PIF-945", "恆春鎮": "PIF-946", "滿州鄉": "PIF-947"
    },
    "宜蘭縣": {
        "宜蘭市": "ILA-260", "頭城鎮": "ILA-261", "礁溪鄉": "ILA-262", "壯圍鄉": "ILA-263", "員山鄉": "ILA-264", "羅東鎮": "ILA-265", "三星鄉": "ILA-266", "大同鄉": "ILA-267", "冬山鄉": "ILA-269", "五結鄉": "ILA-268", "蘇澳鎮": "ILA-270", "南澳鄉": "ILA-272"
    },
    "花蓮縣": {
        "花蓮市": "HUA-970", "新城鄉": "HUA-971", "秀林鄉": "HUA-972", "吉安鄉": "HUA-973", "壽豐鄉": "HUA-974", "鳳林鎮": "HUA-975", "光復鄉": "HUA-976", "豐濱鄉": "HUA-977", "瑞穗鄉": "HUA-978", "萬榮鄉": "HUA-979", "玉里鎮": "HUA-981", "富里鄉": "HUA-983", "卓溪鄉": "HUA-982"
    },
    "臺東縣": {
        "臺東市": "TTT-950", "綠島鄉": "TTT-951", "蘭嶼鄉": "TTT-952", "延平鄉": "TTT-953", "卑南鄉": "TTT-954", "鹿野鄉": "TTT-955", "關山鎮": "TTT-956", "海端鄉": "TTT-957", "池上鄉": "TTT-958", "東河鄉": "TTT-959", "成功鎮": "TTT-961", "長濱鄉": "TTT-962", "太麻里鄉": "TTT-963", "金峰鄉": "TTT-964", "大武鄉": "TTT-965", "達仁鄉": "TTT-966"
    },
    "澎湖縣": {
        "馬公市": "PEN-880", "西嶼鄉": "PEN-881", "望安鄉": "PEN-882", "七美鄉": "PEN-883", "白沙鄉": "PEN-884", "湖西鄉": "PEN-885"
    },
    "金門縣": {
        "金沙鎮": "KIN-890", "金湖鎮": "KIN-891", "金寧鄉": "KIN-892", "金城鎮": "KIN-893", "烈嶼鄉": "KIN-894", "烏坵鄉": "KIN-896"
    },
    "連江縣": {
        "南竿鄉": "LIE-209", "北竿鄉": "LIE-210", "莒光鄉": "LIE-211", "東引鄉": "LIE-212"
    }
};

export const CODE_TO_TOWNSHIP_NAME = {};
for (const county in LOCATION_DATA) {
    for (const township in LOCATION_DATA[county]) {
        const code = LOCATION_DATA[county][township];
        CODE_TO_TOWNSHIP_NAME[code] = `${county}${township}`;
    }
}